In [1]:
import pandas as pd
titanic_df = pd.read_csv('titanic_train.csv')
print('titanic 변수 type:',type(titanic_df))

titanic 변수 type: <class 'pandas.core.frame.DataFrame'>

In [2]:
survived_rate = titanic_df['Survived'].mean()

In [3]:
print(survived_rate)

0.3838383838383838

In [4]:
titanic_df[['Survived', 'Sex']]

     Survived     Sex
0           0    male
1           1  female
2           1  female
3           1  female
4           0    male
..        ...     ...
886         0    male
887         1  female
888         0  female
889         1    male
890         0    male

[891 rows x 2 columns]

In [5]:
titanic_df[titanic_df['Sex']=='female']

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
...,...,...,...,...,...,...,...,...,...,...,...,...
880,881,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,0,1,230433,26.0000,NaN,S
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S

In [6]:
titanic_df['Survived'][titanic_df['Sex']=='female']

1      1
2      1
3      1
8      1
9      1
      ..
880    1
882    0
885    0
887    1
888    0
Name: Survived, Length: 314, dtype: int64

In [7]:
titanic_df['Survived'][titanic_df['Sex']=='female'].mean()

0.7420382165605095

In [8]:
titanic_df['Survived'][titanic_df['Sex']=='male'].mean()

0.18890814558058924

In [9]:
titanic_df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [10]:
titanic_df['Age']>38

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888    False
889    False
890    False
Name: Age, Length: 891, dtype: bool

In [11]:
titanic_df[titanic_df['Age']>38][['Name', 'Age']]

                                                 Name   Age
6                             McCarthy, Mr. Timothy J  54.0
11                           Bonnell, Miss. Elizabeth  58.0
13                        Andersson, Mr. Anders Johan  39.0
15                   Hewlett, Mrs. (Mary D Kingcome)   55.0
30                           Uruchurtu, Don. Manuel E  40.0
..                                                ...   ...
865                          Bystrom, Mrs. (Karolina)  42.0
871  Beckwith, Mrs. Richard Leonard (Sallie Monypeny)  47.0
873                       Vander Cruyssen, Mr. Victor  47.0
879     Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)  56.0
885              Rice, Mrs. William (Margaret Norton)  39.0

[177 rows x 2 columns]

In [12]:
titanic_df[titanic_df['Age']>60][['Name', 'Age']]

                                          Name   Age
33                       Wheadon, Mr. Edward H  66.0
54              Ostby, Mr. Engelhart Cornelius  65.0
96                   Goldschmidt, Mr. George B  71.0
116                       Connors, Mr. Patrick  70.5
170                  Van der hoef, Mr. Wyckoff  61.0
252                  Stead, Mr. William Thomas  62.0
275          Andrews, Miss. Kornelia Theodosia  63.0
280                           Duane, Mr. Frank  65.0
326                  Nysveen, Mr. Johan Hansen  61.0
438                          Fortune, Mr. Mark  64.0
456                  Millet, Mr. Francis Davis  65.0
483                     Turkula, Mrs. (Hedwig)  63.0
493                    Artagaveytia, Mr. Ramon  71.0
545               Nicholson, Mr. Arthur Ernest  64.0
555                         Wright, Mr. George  62.0
570                         Harris, Mr. George  62.0
625                      Sutton, Mr. Frederick  61.0
630       Barkworth, Mr. Algernon Henry Wilson  80.0
672                Mitchell, Mr. Henry Michael  70.0
745               Crosby, Capt. Edward Gifford  70.0
829  Stone, Mrs. George Nelson (Martha Evelyn)  62.0
851                        Svensson, Mr. Johan  74.0

In [13]:
titanic_df['Age'].quantile(q=0.50, interpolation='nearest')

28.0

In [14]:
titanic_df['Age'].quantile(q=0.80, interpolation='nearest')

41.0

In [15]:
old_age=titanic_df['Age'].quantile(q=0.80, interpolation='nearest')
titanic_df[titanic_df['Age']>old_age][['Name', 'Age']]
print(type(old_age))

<class 'numpy.float64'>

In [16]:
titanic_df['Survived'][titanic_df['Age']>old_age].mean()

0.3732394366197183

In [17]:
titanic_df['Survived'][(titanic_df['Age']>old_age)&(titanic_df['Sex']=='male')].mean()

0.1836734693877551

In [18]:
old_age_df = titanic_df[titanic_df['Age']>old_age]

In [19]:
old_age_df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
15,16,1,2,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,0,0,248706,16.0000,NaN,S
33,34,0,2,"Wheadon, Mr. Edward H",male,66.0,0,0,C.A. 24579,10.5000,NaN,S
35,36,0,1,"Holverson, Mr. Alexander Oskar",male,42.0,1,0,113789,52.0000,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
862,863,1,1,"Swift, Mrs. Frederick Joel (Margaret Welles Ba...",female,48.0,0,0,17466,25.9292,D17,S
865,866,1,2,"Bystrom, Mrs. (Karolina)",female,42.0,0,0,236852,13.0000,NaN,S
871,872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,1,11751,52.5542,D35,S
873,874,0,3,"Vander Cruyssen, Mr. Victor",male,47.0,0,0,345765,9.0000,NaN,S
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C

In [20]:
old_age_df['Survived'][old_age_df['Sex']=='male']

6      0
33     0
35     0
54     0
62     0
      ..
818    0
845    0
851    0
857    1
873    0
Name: Survived, Length: 98, dtype: int64

In [21]:
old_age_df['Survived'][old_age_df['Sex']=='male'].mean()

0.1836734693877551

In [22]:
old_age_df['Survived'][old_age_df['Sex']=='female'].mean()

0.7954545454545454

In [55]:
titanic_df_a = titanic_df[titanic_df['Survived'] == 1].groupby('Pclass').count()
titanic_df_a['SurvivalRate'] = titanic_df_a['Survived'] / titanic_df.groupby('Pclass').count()['Survived']
titanic_df_a

,PassengerId,Survived,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,SurvivalRate
Pclass,,,,,,,,,,,,
1,136,136,136,136,122,136,136,136,136,117,134,0.629630
2,87,87,87,87,83,87,87,87,87,13,87,0.472826
3,119,119,119,119,85,119,119,119,119,6,119,0.242363

In [ ]:
Pclass_1 = titanic_df[titanic_df['Pclass'] == 1]

In [ ]:
print(Pclass_1)

In [ ]:
Pclass_2 = titanic_df[titanic_df['Pclass'] == 2]

In [ ]:
Pclass_3 = titanic_df[titanic_df['Pclass'] == 3]

In [ ]:
Pclass_1['Survived']

In [ ]:
Pclass_1['Survived'].mean()

In [ ]:
Pclass_2['Survived'].mean()

In [ ]:
Pclass_3['Survived'].mean()

In [ ]:
Pclass_1['Survived'][Pclass_1['Sex']=='male'].mean()

In [ ]:
Pclass_1['Survived'][Pclass_1['Sex']=='female'].mean()

In [ ]:
Pclass_2['Survived'][Pclass_2['Sex']=='male'].mean()

In [ ]:
Pclass_2['Survived'][Pclass_2['Sex']=='female'].mean()

In [ ]:
Pclass_3['Survived'][Pclass_3['Sex']=='male'].mean()

In [ ]:
Pclass_3['Survived'][Pclass_3['Sex']=='female'].mean()

In [ ]:
old_Pclass_1 = Pclass_1[Pclass['Age']>old_age]

In [ ]:
old_Pclass_1 = Pclass_1[Pclass_1['Age']>old_age]

In [ ]:
print(old_Pclass1)

In [ ]:
print(d_Pclass1)

In [ ]:
print(old_Pclass1)

In [ ]:
old_Pclass_1 = Pclass_1[Pclass_1['Age']>old_age]

In [ ]:
print(old_Pclass_1)

In [ ]:
old_Pclass_1['Survived'].mean()

In [ ]:
old_Pclass_1['Survived'][old_Pclass_1['Sex']=='female'].mean()